import React from "react";
import CardFeature from "../components/card-feature";

export default function Home() {
  return (
    <div className="container mt-5">
      <div className="text-center">
        <h1 className="display-4">Ведення фінансового обліку малого бізнесу</h1>
        <p className="lead">
          Автоматизований розрахунок податків та зручне управління фінансами
        </p>
      </div>

      <div className="row mt-5">
        <CardFeature
          title="📊 Облік доходів та витрат"
          description="Додавайте операції, відстежуйте прибутки та контролюйте витрати."
          link="/"
        />
        <CardFeature
          title="💰 Продаж товарів"
          description="Легко відстежуйте наявність та продаж ваших товарів."
          link="/"
        />
        <CardFeature
          title="📑 Звіти та аналітика"
          description="Формуйте фінансові звіти та аналізуйте розвиток бізнесу."
          link="/"
        />
      </div>
    </div>
  );
}
